<?php
$events=[
    [
        "event" => "携わっている事業が大成功する。1,000万円貰う。",
        "profit" => 1000
    ],
    [
        "event" => "携わっている事業が大失敗する。500万円払う。",
        "profit" => -500
    ],
    [
        "event" => "携わっている事業が大失敗する。500万円払う。",
        "profit" => -500
    ],
    [
        "event" => "投資をしたスタートアップが大成功する。500万円貰う。",
        "profit" => 500
    ],
    [
        "event" => "投資をしたスタートアップが大失敗する。800万円払う。",
        "profit" => -800
    ],
    [
        "event" => "結婚する。知り合いからご祝儀を400万円貰う。",
        "profit" => 400
    ],
    [
        "event" => "結婚する。婚約指輪を購入し200万円払う。",
        "profit" => -200
    ],
    [
        "event" => "副業のプログラミングで一攫千金。400万円貰う。",
        "profit" => 400
    ],
    [
        "event" => "副業で行っている事業が失敗。600万円払う。",
        "profit" => -600
    ],
    [
        "event" => "SNSで有名人になる。書籍を出版し1,000万円貰う。",
        "profit" => 1000
    ],
    [
        "event" => "SNSで大炎上する。訴えられ損害賠償金500万円払う。",
        "profit" => -500
    ],
    [
        "event" => "eSports世界大会で優勝する。700万円貰う。",
        "profit" => 700
    ],
    [
        "event" => "eSports大会に出場し不正が発覚する。400万円払う。",
        "profit" => -400
    ],
    [
        "event" => "ポーカーで大勝ちする。500万円貰う。",
        "profit" => 500
    ],
    [
        "event" => "ポーカーで大負けする。400万円払う。",
        "profit" => -400
    ],
];